# zad70

# Xi = 1 ако се пада ези при i-тото хвърляне, 0 в противен случай
# p = P(Xi=1)
# X=X1+..+Xn, n=100     // X~Bi(n, p)
# H0: p = 1/2, H1: p > 1/2    // хипотези, пита се коя изглежда
#                             // по-правдоподобна
# X/n -> p      // за големи n
# грешка от I тип = {отхвърляме H0, ако H0 е вярна}
# искаме P(грешка от I тип)=alpha, alpha=0.05 // ппц 0.05, 0.01, 0.1
#                                             // т.е. малко число
#           X/n-p
# Z =  ---------------  ~ N(0, 1) от ЦГТ за големи n 
#      sqrt(p(1-p)/n)

# z-obs = горната ф-ла но с малко x // това ще е конкретната ст-т
# x = 58, n = 100, p = 1/2          // знаем n и x, p е от хипотезата

# дефинираме p.value = P(Z >= z-obs) // 1-pnorm(z-obs)
# ако p.value <= alpha=0.05 => отхвърляме H0 в полза на H1
# ако p.value >= alpha  => не можем да отхвърлим H0
x <- 58
p <- 1/2
n <- 100
z.obs <- (x/n - p) / (sqrt(p*(1-p)/n))
z.obs

p.value <- 1-pnorm(z.obs)
p.value # ~= 0.054
# не можем да отхвърлим нулевата хипотеза H0
# т.е. не можем да заключим, че вероятността да се падне ези при
# хвърляне на тази монета е повече от 1/2. // H1


# zad71
x <- 61
z.obs <- (x/n - p) / (sqrt(p*(1-p)/n))
z.obs

p.value <- 1-pnorm(z.obs)
p.value  # ~= 0.013 <= 0.05
x <- c(rep(1, 58), rep(0, 100-58))
t.test(x, mu=0.5, alternative="greater")
prop.test(x=58, n=100, p=0.5, correct=F, alternative="greater")
# отхвърляме хипотезата H0.
# Можем да заключим, че вероятността да се падне ези при
# хвърляне на тази монета е повече от 1/2.


# zad72
# Xi = диаметър на i-тата случ. избрана топка
# n = 45,   1 <= i <= 45
# miu = E(Xi),  sigma = sqrt(D(X)) = 0.12  // съмнения за miu = 6.7
# H0: miu = 6.7    H1: miu != 6.7
# X черта = 1/n(X1+..+Xn)   X черта -> miu

# Z = (Xчерта - miu) / sigma/sqrt(n)   ~ N(0, 1)
# z-obs = същото с х черта малко  // наблюдаваната стойност 6.73
# щом хипотезата е != (а не <) тогава p.value ще бъде
# P(Z <= -|z-obs|) + P(Z >= |z-obs|)
# 2*P(Z<=-|z-obs|)     // понеже е симетрично

n <- 45
sigma <- 0.12
x.bar <- 6.73    # х черта
mu <- 6.7   # от нулевата хипотеза

z.obs <- (x.bar - mu) / (sigma/sqrt(n))
z.obs

p.value <- 2*pnorm(abs(z.obs)*(-1))
p.value #  ~= 0.09 > 0.05
# не можем да отхвърлим нулевата хипотеза
# данните подкрепят твърдението, че средният диаметър на топките,
# произведени от машината е 6.7 см.


# zad73
n <- 45
sigma <- 0.12
x.bar <- 6.76    # х черта
mu <- 6.7   # от нулевата хипотеза

z.obs <- (x.bar - mu) / (sigma/sqrt(n))
z.obs

p.value <- 2*pnorm(abs(z.obs)*(-1))
p.value # ~= 0.0007 <= 0.05
# Отхвърляме нулевата хипотеза в полза на алтернативната.
# Данните не подкрепят твърдението, че средният диаметър на топките,
# произведени от машината е 6.7 см.


# zad74
# Xi = концентрация на кадмий в i-тата гъба
# 1 <= i <= n,  n = 10
# miu = E(Xi)
# H0: miu = 4      H1: miu < 4
# X черта = 1/n(X1+..+Xn)
# S = sqrt( 1/(n-1)  *  сума по i от (Xi-X)^2 )

# T = (Xчерта-miu) / (S/sqrt(n)) ~ t-разпределение с (n-1)
#                                  степени на свобода
# t-obs = същото с x малко // конкретните ст-ти
# p.value = P(T <= t-obs)   // хипотеза за по-малко
# смята се с pt(t-obs, df=n-1)

x <- c(3.1, 3.0, 3.7, 2.6, 4.2, 3.8, 3.6, 2.7, 3.8, 4.4)
x.bar <- mean(x)
s <- sd(x)     # смята онази сума с корен за S (от ред 97)
n <- length(x)
mu <- 4  # хипотеза

t.obs <- (x.bar - mu) / (s/sqrt(n))
t.obs

p.value <- pt(t.obs, df=n-1)
p.value # ~= 0.013 < 0.05
# отхвърляме нулевата хипотеза
# Имаме основание да твърдим, че средната концентрация на
# кадмий в горските гъбите в дадената местност е по-малко от 4 мг/кг.

# help(t.test)   друг начин: 
t.test(x, mu=4, alternative="less")

# zad75
# Xi = 1, ако i-тия гълъб е намерил пътя към дома си, 0 ако не е
# p = P(Xi = 1)     X = X1 + .. + Xn
# H0: p = 0.51       H1: p > 0.51

x <- 32
p <- 0.51
n <- 58
z.obs <- (x/n - p) / (sqrt(p*(1-p)/n))
z.obs

p.value <- 1-pnorm(z.obs)
p.value  # ~= 0.26 > 0.05
# Не можем да отхвърлим нулевата хипотеза p=0.51
# Данните не подкрепят твърдението на изследователя (над 51%)

# help(prop.test)
prop.test(x=32, n=58, p=0.51, correct=F, alternative="greater")


# zad76

x <- c(12.3, 11.2, 14.2, 15.3, 14.8, 13.5, 11.1, 15.1, 15.4, 13.2)

t.test(x, mu=14.6, alternative="two.sided")
t.test(x, mu=14.6, alternative="less")

# zad77 
prices <- c(rep(1, 14), rep(0, 186))
t.test(prices, mu=0.075, alternative="t")$p.value
t.test(prices, mu=0.075, alternative="l")$p.value
prop.test(x=14, n=200, p=0.075, correct=F, alternative="t")$p.value
prop.test(x=14, n=200, p=0.075, correct=F, alternative="l")$p.value

x <- 14
p <- 0.075
n <- 200
z.obs <- (x/n - p) / (sqrt(p*(1-p)/n))
z.obs

p.value <- pnorm(z.obs)
p.value 




# zad79       ? сигурно не е вярна ?
n <- 50
sigma <- 3.9
x.bar <- 168    # х черта
mu <- 170   # от нулевата хипотеза

z.obs <- (x.bar - mu) / (sigma/sqrt(n))
z.obs

p.value <- pnorm(z.obs)
p.value # излиза 0.0001 



