
# A = "успех" , A черта = "неуспех" - Бернулиев опит, P(A)=p
# X = брой успехи в поредица от n опита

# X ~ Bi(n, p) n - биномно разпрадаление, n опита с p шанс за успех
# P(X=k) = (n над k).p^k.(1-p)^(n-k), k = 0,1,2,...,n
#       = dbinom(k,n,p) - вградена функция

# P(X<=k) = pbinom(k,n,p) - пак вградена функция

# zad18
# X = брой шестици при 10 хвърляния
# a) P(X=2)= (1/6)^2 . (5/6)^2 (10 над 2)
dbinom(2,10,1/6)

# same thing:
choose(10,2)*(1/6)^2*(5/6)^8  #  <--- dbinom calculates that

# b) P(X<=2)
pbinom(2,10,1/6)
# same thing:
dbinom(0,10,1/6)+dbinom(1,10,1/6)+dbinom(2,10,1/6)
# same again:
sum(dbinom(0:2,10,1/6))

# в)
# P(X>=2) = 1 - P (X <= 1)
1 - pbinom(1,10,1/6)

# г)
# P(3 <= X <= 8) = P(X <= 8) - P(X <= 2)
pbinom(8,10,1/6)-pbinom(2,10,1/6)
# same thing:
sum(dbinom(3:8,10,1/6))

# zad 19
# X = брой хвърляния, докато не се падне шестица

# P (X=10) = (5/6)^9 . (1/6)     
# X = брой опити до първи успех (вкл.)
# X ~ Ge(P)    - геометрично разпределение
# P(X=k)= (1-p)^(k-1).p =     т.е k-1 неуспеха, последвани от 1 успех
# k = 1,2,3, ...        =dgeom(k-1, p)
#                P(X<=k)=pgeom(k-1, p)

# a) P(X <= 10)
pgeom(10-1, 1/6)
# b) P(X >= 6) = 1 - P( X <= 5)
1-pgeom(5-1, 1/6)

# zad 20

# X = брой опити до r-ти успех
# X ~ NB(r, p)     - отрицателно биномно разпределение
# при r=1 имаме геометричното разпределение
# P(X=k) = dnbinom(k-r, r, p), k = r,r+1,r+2, ...
# P(X<=k) = pnbinom(k-r, r, p) 

# към zad 20:  X = брой хвърляния, докато се паднат 3 шестици
# X ~ NB(r=3, p=1/6)

# P(X<=20)
pnbinom(20-3, 3, 1/6)

# zad 21
# 5 нови, 3 стари, избираме 2
# X = брой нови батерии от избраните
# P(фенерчето не заработва) = P(X=0) + P(X=1)

# P(X = 1) = (5 над 1 * 3 над 1) / (8 над 2)
# P(X = 0) = (5 над 0 * 3 над 2) / (8 над 2) <- dhyper пресмята това
dhyper(0, 5, 3, 2) + dhyper(1, 5, 3, 2) # 5 нови, 3 стари
#same thing but 1 - P(X=2)
1 - dhyper(2, 5, 3 ,2)
help(dhyper)

# zad 22
# X = брой грешки на 1500 думи
# X ~ Bi(n=1500, p=1/500)

n <- 1500
p <- 1/500
# a) P(X<=2)
pbinom(2, n, p)
ppois(2, n*p) # приближение на binom за големи n и малки p
# b) P(1<=X<=3) = P(X<=3) - P(X=0)
pbinom(3, n, p)-dbinom(0, n, p)

# zad 23
# X = брой верни отговори, дадани от Иван
# X ~ Bi(n=10, p=1/4)

# P(X>=5) = 1 - P(X <= 4)
1-pbinom(4, 10, 1/4)

# zad 24
# X = брой пътници, дошли навреме
# X ~ Bi(n=143, p=0.92)

# a) P(X<=138)
pbinom(138, 143, 0.92)

# b) P(X=137)
dbinom(137, 143, 0.92)

# zad 25 
# a)
pgeom(10-1, 0.03) 
# b)    P(X>=2) = 1 - P(X<=1)    
1 - pbinom(1, 50, 0.03)      

# zad 26
# за разлика от зад 25, тук няма връщане, тоест с hyper
# P(X >= 2) = 1 - P (X <= 1)
1 - phyper(1,3,97,50)

# zad 27
1 - phyper(1,90,2910,50)


# zad 28
# P(X>=5) = 1 - P(X <= 4)
1-pgeom(4-1, 1/10)
# P(X>=50) 10 successes = 1 - P(X<=49)
1-pnbinom(49-10, 10, 1/10)

# zad 29
# P(X>3) = 1 - P(X<=3)
1-pnbinom(360-3, 3, 1/90)

#zad 30
1-phyper(1, 13, 52-13, 10)

#zad 31      P(X>=2) = 1 - P(X<=1)
1-pnbinom(10-1, 1, 1/4)    #?????







































